Pandas

Pandas is a package in the python library which is used for data import , data cleaning ,making suitable form and descriptive analysis like mean mode median etc with tabular data(in row column)
we can sort ,make subset,summarize,reshaping and joining in tabulat data

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\mradi\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mradi\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\mradi\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\mradi\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\mradi\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\mradi\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

importing pd is used as shortcut for pandas

In [4]:
import pandas as pd

In [9]:
data1={ "Name":["Aditya", "Abhishek","Ayush","Adhar","Dinkar"],"Maths_Marks":[20,21,20,24,25],"Interview_Marks":[18,19,19,24,18]}

In [10]:
type(data1)

dict

In [11]:
a=pd.DataFrame(data1)

In [12]:
a

       Name  Maths_Marks  Interview_Marks
0    Aditya           20               18
1  Abhishek           21               19
2     Ayush           20               19
3     Adhar           24               24
4    Dinkar           25               18

In [25]:
type(a)

pandas.core.frame.DataFrame

In [26]:
#dataframe data structure

In pandas 2 type of data structure:-
1.DATAFRAME: sql ,spreadsheet ,2d data structure(having rows and column)
2.SERIES: each column in dataframe

In [17]:
b=a['Name']

In [18]:
b

0      Aditya
1    Abhishek
2       Ayush
3       Adhar
4      Dinkar
Name: Name, dtype: object

In [24]:
type(b)

pandas.core.series.Series

In [19]:
l1=["Aditya","gupta","hello","bhai"]

In [21]:
c=pd.Series(l1)

In [22]:
c

0    Aditya
1     gupta
2     hello
3      bhai
dtype: object

In [23]:
type(c)

pandas.core.series.Series

In [37]:
thisdict = {
  "brand": "Ford",
  "electric": False,
  "year": [1964,1965,1968],
  "colors": ["red", "white", "blue"]
}

In [38]:
d=pd.DataFrame(thisdict)

In [39]:
d

  brand  electric  year colors
0  Ford     False  1964    red
1  Ford     False  1965  white
2  Ford     False  1968   blue

In [40]:
c=d['year']

In [41]:
c

0    1964
1    1965
2    1968
Name: year, dtype: int64

In [42]:
c=d['brand']

In [43]:
c

0    Ford
1    Ford
2    Ford
Name: brand, dtype: object

In [44]:
c=d['colors']

In [45]:
c

0      red
1    white
2     blue
Name: colors, dtype: object

In [46]:
type(c)

pandas.core.series.Series

In [47]:
d.describe()

              year
count     3.000000
mean   1965.666667
std       2.081666
min    1964.000000
25%    1964.500000
50%    1965.000000
75%    1966.500000
max    1968.000000

In [53]:
Data2={"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital": ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.67, 2.98],
"population" : [200.4, 143.5, 1252, 133, 4.3]}

In [54]:
e=pd.DataFrame(Data2)

In [55]:
e

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [56]:
e.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [57]:
data3=dict(country = ["Brazil", "Russia", "India", "China", "South Africa"],
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
area = [8.516, 17.10, 3.286, 9.67, 2.98],
population = [200.4, 143.5, 1252, 133, 4.3])

In [58]:
type(data3)

dict

In [59]:
f=pd.DataFrame(data3)

In [60]:
f

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [70]:
f.shape

(5, 4)

In [66]:
data3['country']

['Brazil', 'Russia', 'India', 'China', 'South Africa']

In [71]:
f.index

RangeIndex(start=0, stop=5, step=1)

In [73]:
f.index=('A','B','C','D','E')

In [74]:
f

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [87]:
f.index=range(1,6,1)

In [88]:
f

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
2        Russia     Moscow  17.100       143.5
3         India  New Delhi   3.286      1252.0
4         China    Beijing   9.670       133.0
5  South Africa   Pretoria   2.980         4.3

In [89]:
f.index=range(::2)

SyntaxError: invalid syntax (1251320527.py, line 1)

In [90]:
f.index=range(1,10,2)

In [91]:
f

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [97]:
f.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [98]:
f.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [99]:
list(f.columns)

['country', 'capital', 'area', 'population']

In [100]:
f['area']

1     8.516
3    17.100
5     3.286
7     9.670
9     2.980
Name: area, dtype: float64

In [101]:
f.area

1     8.516
3    17.100
5     3.286
7     9.670
9     2.980
Name: area, dtype: float64

In [104]:
f.area.max()           #max is function so use paranthesis

17.1

In [92]:
k=f['country']

In [93]:
k

1          Brazil
3          Russia
5           India
7           China
9    South Africa
Name: country, dtype: object

In [94]:
g=f.describe()

In [95]:
g

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

property (we do not use paranthesis) and  function(use paranthesis)

In [116]:
m=f

In [119]:
m

   index       country    capital    area  population
0      1        Brazil   Brasilia   8.516       200.4
1      3        Russia     Moscow  17.100       143.5
2      5         India  New Delhi   3.286      1252.0
3      7         China    Beijing   9.670       133.0
4      9  South Africa   Pretoria   2.980         4.3

In [120]:
m.index

RangeIndex(start=0, stop=5, step=1)

In [135]:
m.index=('a','b','c','d','e')

In [136]:
m

  level_0  index       country    capital    area  population
a       a      1        Brazil   Brasilia   8.516       200.4
b       b      3        Russia     Moscow  17.100       143.5
c       c      5         India  New Delhi   3.286      1252.0
d       d      7         China    Beijing   9.670       133.0
e       e      9  South Africa   Pretoria   2.980         4.3

In [138]:
m

  level_0  index       country    capital    area  population
a       a      1        Brazil   Brasilia   8.516       200.4
b       b      3        Russia     Moscow  17.100       143.5
c       c      5         India  New Delhi   3.286      1252.0
d       d      7         China    Beijing   9.670       133.0
e       e      9  South Africa   Pretoria   2.980         4.3

In [139]:
m.index=range(1,10,2)

In [140]:
m

  level_0  index       country    capital    area  population
1       a      1        Brazil   Brasilia   8.516       200.4
3       b      3        Russia     Moscow  17.100       143.5
5       c      5         India  New Delhi   3.286      1252.0
7       d      7         China    Beijing   9.670       133.0
9       e      9  South Africa   Pretoria   2.980         4.3

m.reset_index(inplace=True)    isse reset ho jayega pemanently